{
  "original_post": {
    "title": "Kayaking footwear",
    "author": "impootinlikevladimir",
    "date": "1713136248.0",
    "content": "I was wondering if you guys had recommendations for shoes to wear kayaking.  I was wearing crocs and they have usually served well, but where I live now there are a lot of muddy banks that crocs just have 0 traction on.  Just curious what you guys do?  Just suck it up or are there better options?"
  },
  "comments": [
    {
      "author": "_byetony_",
      "date": "1713138067.0",
      "content": "What kind of kayak do you have, what type of kayaking are you doing? How often do you were exit? Are you in surf? Are you in rocks? How often do you have to worry about things you are wearing being sucked off you by ocean or river hydraulic motion?\n\nAll these q are relevant\n\nThat said NRS’ basic wet shoe is pretty good in the taller height rather than anke",
      "upvotes": 17,
      "replies": [
        {
          "author": "impootinlikevladimir",
          "date": "1713184927.0",
          "content": "I have a sit on top.  River/creek kayaking pretty much exclusively.  I also just got a sea eagle explorer that at some point want to go try some white water stuff.  But got it alot for kayak camping that would be able to take a dog and some gear.",
          "upvotes": 3,
          "replies": []
        }
      ]
    },
    {
      "author": "WrongfullyIncarnated",
      "date": "1713139343.0",
      "content": "I love my chacos been boating in them since i was 16",
      "upvotes": 15,
      "replies": [
        {
          "author": "kratly",
          "date": "1713147830.0",
          "content": "Yeah I wear and love my Chacos when I’m kayaking.",
          "upvotes": 3,
          "replies": [
            {
              "author": "WrongfullyIncarnated",
              "date": "1713148049.0",
              "content": "Are you a toe strap or no toe strap person?",
              "upvotes": 2,
              "replies": [
                {
                  "author": "kratly",
                  "date": "1713148092.0",
                  "content": "No toe strap for me.",
                  "upvotes": 3,
                  "replies": [
                    {
                      "author": "WrongfullyIncarnated",
                      "date": "1713148870.0",
                      "content": "Me either!  There are dozens of us! Dozens!!",
                      "upvotes": 5,
                      "replies": [
                        {
                          "author": "bananatam",
                          "date": "1713188379.0",
                          "content": "I had been eyeing some Chacos (or Tevas, or similar) for ages before I found a pair for about half off the same day my sneakers blew apart doing some spring hiking/skiing. \n\nThey might be the ultimate adventure shoe. I got the toe strap (beggers can't be choosers) but you can drop it down if you want a more relaxed fit. I used to Kayak barefoot most of the time but the chacos changed that.",
                          "upvotes": 2,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "author": "CMTcowgirl",
                      "date": "1713181771.0",
                      "content": "No toe strap, mega z clouds",
                      "upvotes": 1,
                      "replies": []
                    }
                  ]
                },
                {
                  "author": "Etweety",
                  "date": "1713212143.0",
                  "content": "Has to be with the toe strap. It adds so much support for walking in water.",
                  "upvotes": 1,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "author": "desertkayaker",
      "date": "1713139276.0",
      "content": "Teva - Terra Sandals.",
      "upvotes": 13,
      "replies": []
    },
    {
      "author": "h20rabbit",
      "date": "1713149037.0",
      "content": "I'm a sea kayaker and have been using the same NRS wet shoes for years. Not sure if they make the soles as well these days, but mine are great. I like a snug shoe as it keeps sand and shells out and the sole is thick enough to protect my feet on a variety of terrain. Personally, I super dislike sand in my shoes and rubbing straps of sandals in those conditions.",
      "upvotes": 5,
      "replies": []
    },
    {
      "author": "Many-Salad-5680",
      "date": "1713140548.0",
      "content": "Keens closed toe sandals. But I use the Bass Pro Shop brand because they are cheaper than Keens but still do the exact same thing",
      "upvotes": 11,
      "replies": [
        {
          "author": "staticfired",
          "date": "1713145136.0",
          "content": "Same.   Easy to rinse out after I get in and my feet stay pretty clean",
          "upvotes": 2,
          "replies": []
        },
        {
          "author": "impootinlikevladimir",
          "date": "1713191133.0",
          "content": "I think im liking the idea of these keens.  It being solid around the toes seems like it would help keep pebbles out and I guess from jamming your toes on rocks",
          "upvotes": 2,
          "replies": []
        }
      ]
    },
    {
      "author": "SexIsBetterOutdoors",
      "date": "1713138627.0",
      "content": "The old school jungle boots with drain holes.",
      "upvotes": 4,
      "replies": []
    },
    {
      "author": "anonsensenameisthis",
      "date": "1713145218.0",
      "content": "Astral designs. Kayaking shoes and pfds. They are the best.",
      "upvotes": 3,
      "replies": []
    },
    {
      "author": "BannedMyName",
      "date": "1713138512.0",
      "content": "If I'm yaking I'm barefoot",
      "upvotes": 10,
      "replies": [
        {
          "author": "NagasakiFanny",
          "date": "1713149268.0",
          "content": "🤝\n\nThis is me too",
          "upvotes": 0,
          "replies": []
        }
      ]
    },
    {
      "author": "BuffaloBoyHowdy",
      "date": "1713139050.0",
      "content": "Old running shoes with wool socks.  Warm and cozy even when wet.  They dry out fairly quickly when I'm done.  And pretty good traction on just about anything.",
      "upvotes": 5,
      "replies": []
    },
    {
      "author": "Fuzzy-Dragonfruit589",
      "date": "1713164368.0",
      "content": "I just use Crocs, but if traction is the issue, ”All Terrain” Crocs exist with a better sole. Haven’t tried them myself!",
      "upvotes": 3,
      "replies": []
    },
    {
      "author": "twoblades",
      "date": "1713136770.0",
      "content": "Astral Brewers have pretty good traction on mud, but really excel on slippery rocks. Keen Newport H2 sandals have a pretty aggressive tread too.",
      "upvotes": 4,
      "replies": [
        {
          "author": "impootinlikevladimir",
          "date": "1713184951.0",
          "content": "I looked at these.  I like that these are a bit wider in the front of the foot.  But i don't understand how they drain?  Is it just the 2 holes at the sides?",
          "upvotes": 1,
          "replies": [
            {
              "author": "twoblades",
              "date": "1713185463.0",
              "content": "No, they have drain holes in the toe and heel too.",
              "upvotes": 1,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "author": "F-150Pablo",
      "date": "1713137114.0",
      "content": "I got some water shoes from dicks. Not expensive by any means but do good. I used to be a crocs person myself and still sometimes do.",
      "upvotes": 2,
      "replies": []
    },
    {
      "author": "MrWaldengarver",
      "date": "1713137879.0",
      "content": "I like the Bodyglove water shoes.  They're good at keeping the tiny rocks out.",
      "upvotes": 2,
      "replies": []
    },
    {
      "author": "arethius",
      "date": "1713140385.0",
      "content": "altama maritime lows",
      "upvotes": 2,
      "replies": []
    },
    {
      "author": "Stevenhuskisson",
      "date": "1713141022.0",
      "content": "I like wearing shoes that I don’t mind getting dirty. If they get wet they are coming off and thrown in the back of the kayak",
      "upvotes": 2,
      "replies": []
    },
    {
      "author": "baddspellar",
      "date": "1713141111.0",
      "content": "I picked up a pair of Chacos at Sierra Trading Post for a good price. They always seem to have closeouts on sale",
      "upvotes": 2,
      "replies": []
    },
    {
      "author": "Disgruntlementality",
      "date": "1713143941.0",
      "content": "I just wear Birkenstocks and kick em’ off when I’m in the boat.",
      "upvotes": 2,
      "replies": []
    },
    {
      "author": "ipoobah",
      "date": "1713146757.0",
      "content": "Merrell  Accentor 3 Sieve. Love them!",
      "upvotes": 2,
      "replies": []
    },
    {
      "author": "B-More_Orange",
      "date": "1713146835.0",
      "content": "Chacos",
      "upvotes": 2,
      "replies": []
    },
    {
      "author": "Kuplu_cunei",
      "date": "1713153345.0",
      "content": "Cold weather crocs with socks if necessary - warm weather teva sandals - hot weather barefoot.",
      "upvotes": 2,
      "replies": []
    },
    {
      "author": "wolf_knickers",
      "date": "1713170475.0",
      "content": "In summer I have a strong preference for going barefoot in my kayak, although I keep a pair of rubber flip flops with me in case I need them. Throughout the winter I wear Astral Brewers or NRS wet shoes with my drysuit.",
      "upvotes": 2,
      "replies": []
    },
    {
      "author": "Dr0110111001101111",
      "date": "1713174664.0",
      "content": "I bought a pair of astral loyaks a couple of years ago and now they’re my only choice for kayaking.",
      "upvotes": 2,
      "replies": []
    },
    {
      "author": "Fishing-Kayak",
      "date": "1713179167.0",
      "content": "I had Walmart shoes at first , those things fell apart and weren't super comfortable. I bought a pair on Amazon for $34 , and they are so much better https://amzn.to/3JhWFID",
      "upvotes": 2,
      "replies": []
    },
    {
      "author": "musedrainfall",
      "date": "1713181736.0",
      "content": "I've been using vibram fivefingers for about a decade now and I've been a fan.",
      "upvotes": 2,
      "replies": []
    },
    {
      "author": "kdanger",
      "date": "1713196407.0",
      "content": "I love my Vibram water shoes. Go on, laugh it up 😂",
      "upvotes": 2,
      "replies": []
    },
    {
      "author": "latenightcaller",
      "date": "1713200926.0",
      "content": "Vibram 5 Fingers",
      "upvotes": 2,
      "replies": []
    },
    {
      "author": "m8k",
      "date": "1713212396.0",
      "content": "I wear sandals or Vibram Five Fingers",
      "upvotes": 2,
      "replies": []
    },
    {
      "author": "Jmsnwbrd",
      "date": "1713137999.0",
      "content": "I swear by Adidas Terrex water shoes.",
      "upvotes": 2,
      "replies": []
    },
    {
      "author": "psiprez",
      "date": "1713144565.0",
      "content": "Walmart water shoes. $10.",
      "upvotes": 3,
      "replies": []
    },
    {
      "author": "billythygoat",
      "date": "1713140736.0",
      "content": "So shoes from brands like Chacos, Teva, or Keen would be a good option. Some have real good traction, but mud is hard to navigate still.",
      "upvotes": 2,
      "replies": []
    },
    {
      "author": "bassjam1",
      "date": "1713185555.0",
      "content": "Keen sandals with the closed toe because I kayak a lot of streams with shallow sharp rocky bottoms.  If I was just dealing with mud or sand I might wear a regular sandal.",
      "upvotes": 1,
      "replies": []
    },
    {
      "author": "Horrorllama",
      "date": "1713186211.0",
      "content": "i use a water shoe that has some treads (found on Amazon), though I must admit that I am not typically climbing out into mud; usually rocks or sand",
      "upvotes": 1,
      "replies": []
    },
    {
      "author": "ruthie_imogene",
      "date": "1713190339.0",
      "content": "Teva Hurricanes. If it's colder (Ontario, Canada) I add neoprene socks. They are maybe 6mm thick? Game changer.       \nI don't kayak barefoot.        \nSometimes in shoulder season I wear waterproof hiking boots but I'm experienced in cold water, fully clothed submersion so wouldn't recommend actual footwear unless you're prepared.",
      "upvotes": 1,
      "replies": []
    },
    {
      "author": "I_Am_Terra",
      "date": "1713193741.0",
      "content": "Some random water shoes I bought when I was in Spain. The sand on the beaches in Costa Brava / Tossa De Mar (can’t remember which one) were really rocky so they had a ton of stalls selling shoes. Think the brand’s called Nicoboco, but it seems from research that they no longer exist.\n\nEdit: made the mistake of wearing my favourite Converses when I went to summer camp (I did all the water activities of course) when I was younger and they faded.",
      "upvotes": 1,
      "replies": []
    },
    {
      "author": "RainInTheWoods",
      "date": "1713195634.0",
      "content": "I wear Keen Newport H2.",
      "upvotes": 1,
      "replies": []
    },
    {
      "author": "ryan1064",
      "date": "1713196857.0",
      "content": "could just wear swim shoes and pick a pair that has the tread you desire. They normally fit tightly on your feet and shouldn't slip off. I use them to avoid getting my feet shredded by zebra muscles.",
      "upvotes": 1,
      "replies": []
    },
    {
      "author": "KGoo",
      "date": "1713197350.0",
      "content": "Crocs. Tried em all and Crocs are best.",
      "upvotes": 1,
      "replies": []
    },
    {
      "author": "cmatthewssmith",
      "date": "1713202601.0",
      "content": "Amazon water shoes.",
      "upvotes": 1,
      "replies": []
    },
    {
      "author": "Mosunero",
      "date": "1713207700.0",
      "content": "Nothing feels more secure than Standard Issued ACU boots",
      "upvotes": 1,
      "replies": []
    },
    {
      "author": "StarGehzer",
      "date": "1713211048.0",
      "content": "I went to a SCUBA Diving shop & bought neoprene shoes with a rubber sole. Almost like wearing nothing, but they protect my feet.",
      "upvotes": 1,
      "replies": []
    },
    {
      "author": "Etweety",
      "date": "1713212110.0",
      "content": "Chacos, but has to be the ones that go around the toe. They offer the best support for being in water with rocks and mud.",
      "upvotes": 1,
      "replies": []
    },
    {
      "author": "Sugary_Plumbs",
      "date": "1713220232.0",
      "content": "Crocs. I have a sit inside and I don't wear them in the boat, but getting in and out they're great. They drain well, they hold up to abuse, they float better than anything else if you lose one and have to chase after it.",
      "upvotes": 1,
      "replies": []
    },
    {
      "author": "blackbusa24",
      "date": "1713220244.0",
      "content": "I wear Merrell Vapor Gloves (not a water shoe, but they work great) normally and NRS boundary boots for cold weather.",
      "upvotes": 1,
      "replies": []
    },
    {
      "author": "tisrachel",
      "date": "1713420956.0",
      "content": "I always wear my Vibram 5 Fingers. Absolutely the best.",
      "upvotes": 1,
      "replies": []
    },
    {
      "author": "BuenasVistas",
      "date": "1713558307.0",
      "content": "I have worn different types of shoes and what I have settled with is just an old pair of sneakers. I prefer closed toed, and they’re easy enough to take off. The grip on them is usually better too.",
      "upvotes": 1,
      "replies": []
    }
  ]
}