{
  "original_post": {
    "title": "Working two jobs and still can't afford my bills.",
    "author": "adamduke88",
    "date": "1683229264.0",
    "content": "So I've been working two jobs for a little over a year now. A full time and a part time. Full time reduced my hours and I can't work more at the other job. It's now getting to the point that I can't afford my bills and I'm starting to worry. \n\nAfter taxes I make about $2600 a month. My rent is $1250, I pay $100 a month for my phone, another $100 for insurance, and another $1100 in CC and loan payments. Also roughly $200 for gas and $300 for groceries.\n\nAt this point I'm over my income by a few hundred bucks and I literally have nothing extra for emergencies. I'm getting deeper into debt by having to use my credit cards as well to cover gas and groceries when I need to. \n\nAt this point is it better to attempt bankruptcy or just stop paying certain bills? If I get sued for garnishment how much do you think they'll take out of my check?  \n\nAny help or advice would be greatly appreciated."
  },
  "comments": [
    {
      "author": "Valley413",
      "date": "1683240186.0",
      "content": "Look into USPS. Seriously. It's a career if you can get your foot in the door, and right now, the door is wide open through much of the country. Their big problem is short staffing, and new hires tend to get forced to work a ton of overtime, which on your case is a good thing to get caught up.",
      "upvotes": 710,
      "replies": [
        {
          "author": "Okcicad",
          "date": "1683248052.0",
          "content": "I'd advise OP to go over to r/USPS to get a taste of it. Most people are complaining about overtime in that sub. Which OP needs a ton of!",
          "upvotes": 327,
          "replies": [
            {
              "author": "CoconutSands",
              "date": "1683257320.0",
              "content": "I used to work at the Post Office. It's not an easy job and it's not for everybody. But if you can make a go of it there, it's a decent career for a low barrier of entry. Plenty of overtime, probably much more than you would actually want. But it would be better than working two jobs getting only base pay. They do have a good union but really terrible management.",
              "upvotes": 183,
              "replies": [
                {
                  "author": "jackinwol",
                  "date": "1683265495.0",
                  "content": "I applied and tried to get in for a while but my area was fully staffed, so your mileage may vary",
                  "upvotes": 39,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "author": "Cincymailman",
          "date": "1683273900.0",
          "content": "Good advice. OP says they’re in San Diego. They’re desperate for carriers there. They’d be hired on the spot. They’d make at least 80k their first year. Pension, 401k matching (tsp), paid vacation and sick leave, paid holidays, strong union, would quickly get in the best shape of their life, etc.\n\nI’m the Union steward and new carrier trainer at my station. I’ve started to see in the last year that more young people are applying and sticking with it (early 20’s). So, the easy barrier to entry is not going to be around forever.",
          "upvotes": 73,
          "replies": []
        }
      ]
    },
    {
      "author": "Phenix4Life",
      "date": "1683229593.0",
      "content": "Without posting your debts, there no way for wanyone to give you any good advice.\n\nGarnishment is an unknown as it varies per state.",
      "upvotes": 316,
      "replies": []
    },
    {
      "author": "Locke1557",
      "date": "1683230090.0",
      "content": "I am not an expert. But reduce your phone bill. I use T-Mobile prepay and my wife uses Mint mobile. Both of our phones are 70 bucks",
      "upvotes": 281,
      "replies": [
        {
          "author": "adamduke88",
          "date": "1683230270.0",
          "content": "I'm planning to as soon as I'm done paying it off in a couple months.",
          "upvotes": 65,
          "replies": [
            {
              "author": "seztomabel",
              "date": "1683234341.0",
              "content": "I pay 35/month for cricket with no issues.",
              "upvotes": 105,
              "replies": [
                {
                  "author": "Digitized_self",
                  "date": "1683247455.0",
                  "content": "I second cricket. Three lines and we pay $90 a month for unlimited talk/text/data.",
                  "upvotes": 38,
                  "replies": []
                }
              ]
            },
            {
              "author": "74orangebeetle",
              "date": "1683247189.0",
              "content": "I use mint mobile, $15/month...that gives 5GB/month data..they have other plans if you need more data than that (Which are still a fraction of the cost you pay now).  Biggest catch is it uses T-Mobile network, but I'd imagine coverage is good in San diego",
              "upvotes": 42,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "author": "Arttiesy",
      "date": "1683233156.0",
      "content": "I'd move away from San Diego, it's seriously overpriced- start looking for work in cheaper parts of the country outside of CA.",
      "upvotes": 114,
      "replies": []
    },
    {
      "author": "fraidycat",
      "date": "1683230048.0",
      "content": "Where do you live? What do you do for a living? Can you find a higher-paying job? How long have you been in those jobs? What are the interest rates and total amounts on your debts?",
      "upvotes": 82,
      "replies": [
        {
          "author": "adamduke88",
          "date": "1683230245.0",
          "content": "San Diego, medical supply, looked but super competitive job market, FT for 2 years, PT for 1 year. Interest rates I'm unsure of but most are in the 15-25% range I think.",
          "upvotes": 69,
          "replies": [
            {
              "author": "shiratama_dango",
              "date": "1683230738.0",
              "content": "Have you looked into manufacturing tech jobs? Lots of positions with OT.",
              "upvotes": 54,
              "replies": [
                {
                  "author": "adamduke88",
                  "date": "1683231121.0",
                  "content": "I've applied to dozens of jobs and haven't even received as much as a call back.",
                  "upvotes": 43,
                  "replies": [
                    {
                      "author": "fraidycat",
                      "date": "1683231659.0",
                      "content": "Consider reaching out to workforce development organizations. Maybe the problem is your resume, and they can help you improve it. Maybe they'll know about other job opps. Work it! You don't have to make much more to break even. It seems too soon to be considering bankruptcy. You didn't say what the total amount of your debts are, though. Run them through [https://unbury.me/](https://unbury.me/) and figure out the best order in which to pay them off.",
                      "upvotes": 93,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "author": "poolguyforever",
              "date": "1683248431.0",
              "content": "40k a year (before taxes) working 2 jobs in southern California?  Abscond to Texas.  ASAP.",
              "upvotes": 38,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "author": "CookieAdventure",
      "date": "1683230470.0",
      "content": "Your rent is killing you. You can’t afford it.\n\nUntil you can move …\n\n- Cancel your cellphone plan. Get on the cheapest pay-as-you-go plan available. You might even have to cut cell service completely and live with just texting and email over borrowed WiFi.\n\n- Stop driving. If your second job involves driving, then change jobs. Waiting tables, bartending, and working events makes good money.\n\n- Call your credit card companies and beg for a debt repayment plan. You’ll have to stop charging to the cards but they’ll lower your interest rates and put you on an affordable payment plan.",
      "upvotes": 59,
      "replies": []
    },
    {
      "author": "middlestauthor",
      "date": "1683240161.0",
      "content": "You say you are making 2600 working two jobs. Are those full time? Is at least one full time? You need to be working close to 50-60 hours a week if you want out of this debt. Then every red cent goes toward the debt using the snowball method. Do that for 2 years and you should be really close to free. Then SAVE AN EMERGENCY FUND right away. I would say at least $10k in your situation",
      "upvotes": 58,
      "replies": [
        {
          "author": "FailingComic",
          "date": "1683245679.0",
          "content": "this 100%. Its two part time jobs. I would be suprised if they even are 40 hours combined. Im taking 2k a month take home working at walmart full time.",
          "upvotes": 39,
          "replies": []
        }
      ]
    },
    {
      "author": "TgGIo",
      "date": "1683245119.0",
      "content": "$2600 a month kinda low for 2 jobs,\nI also have 2 jobs but make around $3500 one full and part , cell phone bill is high switch to prepaid,",
      "upvotes": 35,
      "replies": []
    },
    {
      "author": "yamaha2000us",
      "date": "1683233551.0",
      "content": "I am guessing that $1250 is a single rental apartment and $1100 is … mostly\nCC.\n\nOne of those is going to need to change.\n\nCan you get a roommate or move back home?",
      "upvotes": 29,
      "replies": [
        {
          "author": "adamduke88",
          "date": "1683235332.0",
          "content": "Have a roommate. Cost of living in SD in insane. No family to move in with.",
          "upvotes": 48,
          "replies": []
        }
      ]
    },
    {
      "author": "Ender505",
      "date": "1683251408.0",
      "content": "> I'm starting to worry\n\n> *Has $27K debt*\n\nBuddy you should be wayyyy past worry by now. Not to make you feel worse...\n\nA lot to unpack here. First off, the headline should be: \"I have 27K in loan debt (CC and otherwise) what do I do?\" This is your critical issue. Look at that budget you laid out, and notice how without the loans, you have a healthy surplus. \n\nThe only way to get to that point is to have some very unhealthy spending habits in the first place. So until that is addressed, you're stuck. \n\n- absolutely no eating out. If you haven't tried \"intermittent fasting\" yet, you'll want to look into that purely for cost savings. Your calories for the foreseeable future should come from mostly rice and beans. Learn how to make those tasty because you really can't afford much else. \n\n- if you're looking for a reason to quit any habits like drinking or smoking/vaping, this is a big one. Those are very expensive habits. \n\n- if one of those loans is an expensive car, see if you can sell it without losing even more money and get a very used car with hopefully better gas mileage instead.\n\n- drop all of your entertainment subscriptions (e.g. steaming services) except one to keep you sane. Drop your internet plan to the cheapest plan and your data plan to the cheapest, or switch to some garbage provider like cricket to save money. \n\n- start working out if you aren't already. This seems like a weird tip, but if you live in the US, health problems can be very expensive to fix, but very cheap to prevent. \n\nAnd last, be honest with your friends and family if you are invited to an outing that costs money. \"Sorry guys, I fucked up and I need to be a bit safer with how I spend money. Thank you though!\"",
      "upvotes": 26,
      "replies": []
    },
    {
      "author": "sephiroth3650",
      "date": "1683230638.0",
      "content": "Any options to get a different job that will give you more hours?  Your regular full time job cut your hours.  Your part time job won't give you more.  Can you replace one of those jobs with a different one that will give you more hours?  \n\nAs far as stopping bill payments or bankruptcy.....much more info is needed.  Would need to know loan balances, interest rates, and a full breakdown of your entire budget.  Bankruptcy isn't a magic cure all.  And it's not free.  You have to pay to file bankruptcy.  So it doesn't always make sense for people, because they may pay as much for bankruptcy as they owe on their debts to begin with.",
      "upvotes": 24,
      "replies": []
    },
    {
      "author": "Johnny09876",
      "date": "1683244166.0",
      "content": "There’s no way you “need” to have a $100 phone bill.",
      "upvotes": 20,
      "replies": []
    }
  ]
}